zencoding/zxml/testdata/badgerfish/soap_example.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Body>
    <p:itinerary xmlns:p="http://travelcompany.example.org/reservation/travel">
      <p:departure>
        <p:seatPreference>aisle</p:seatPreference>
        <p:arriving>Los Angeles</p:arriving>
        <p:departing>New York</p:departing>
        <p:departureDate>2007-12-14</p:departureDate>
        <p:departureTime>late afternoon</p:departureTime>
      </p:departure>
      <p:return>
        <p:departureDate>2007-12-20</p:departureDate>
        <p:departureTime>mid-morning</p:departureTime>
        <p:seatPreference></p:seatPreference>
        <p:arriving>New York</p:arriving>
        <p:departing>Los Angeles</p:departing>
      </p:return>
    </p:itinerary>
  </env:Body>
  <env:Header>
    <n:passenger env:role="http://www.w3.org/2003/05/soap-envelope/role/next"
      xmlns:n="http://mycompany.example.com/employees">
      <n:name>Fred Bloggs</n:name>
    </n:passenger>
    <m:reservation env:role="http://www.w3.org/2003/05/soap-envelope/role/next"
      xmlns:m="http://travelcompany.example.org/reservation">
      <m:dateAndTime>2007-11-29T13:20:00.000-05:00</m:dateAndTime>
      <m:reference>uuid:093a2da1-q345-739r-ba5d-pqff98fe8j7d</m:reference>
    </m:reservation>
  </env:Header>
</env:Envelope>